---
title: ContinuousRailType
classe: Autodesk.Revit.DB.Architecture.ContinuousRailType
namespace: Autodesk.Revit.DB.Architecture
eredita: Autodesk.Revit.DB.ElementType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 12
---

# ContinuousRailType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `RailTypeDefaultJoinOption DefaultJoinOption { get; set; }` | `continuousRailType.DefaultJoinOption` | RailTypeDefaultJoinOption |
| `Double EndOrTopExtensionLength { get; set; }` | `continuousRailType.EndOrTopExtensionLength` | Double |
| `RailExtensionStyle EndOrTopExtensionStyle { get; set; }` | `continuousRailType.EndOrTopExtensionStyle` | RailExtensionStyle |
| `ElementId EndOrTopTermination { get; set; }` | `continuousRailType.EndOrTopTermination` | ElementId |
| `Double FilletRadius { get; set; }` | `continuousRailType.FilletRadius` | Double |
| `Double HandClearance { get; set; }` | `continuousRailType.HandClearance` | Double |
| `ElementId ProfileId { get; set; }` | `continuousRailType.ProfileId` | ElementId |
| `Double Projection { get; }` | `continuousRailType.Projection` | Double |
| `Double StartOrBottomExtensionLength { get; set; }` | `continuousRailType.StartOrBottomExtensionLength` | Double |
| `RailExtensionStyle StartOrBottomExtensionStyle { get; set; }` | `continuousRailType.StartOrBottomExtensionStyle` | RailExtensionStyle |
| `ElementId StartOrBottomTermination { get; set; }` | `continuousRailType.StartOrBottomTermination` | ElementId |
| `RailTransitionOption Transition { get; set; }` | `continuousRailType.Transition` | RailTransitionOption |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```